fio-test/results/14jobs_10worker_64k/9-psync-3.out
job1: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 9 processes

job1: (groupid=0, jobs=9): err= 0: pid=163775: Tue Aug 20 18:56:21 2024
  write: IOPS=28.3k, BW=1767MiB/s (1853MB/s)(379GiB/219426msec); 0 zone resets
    clat (usec): min=70, max=5189, avg=313.32, stdev=79.22
     lat (usec): min=72, max=5192, avg=316.20, stdev=79.53
    clat percentiles (usec):
     |  1.00th=[  210],  5.00th=[  223], 10.00th=[  231], 20.00th=[  241],
     | 30.00th=[  258], 40.00th=[  306], 50.00th=[  330], 60.00th=[  334],
     | 70.00th=[  343], 80.00th=[  347], 90.00th=[  367], 95.00th=[  412],
     | 99.00th=[  709], 99.50th=[  758], 99.90th=[  824], 99.95th=[  857],
     | 99.99th=[ 1336]
   bw (  MiB/s): min= 1361, max= 2403, per=100.00%, avg=1770.09, stdev=26.51, samples=3937
   iops        : min=21790, max=38458, avg=28320.87, stdev=424.15, samples=3937
  lat (usec)   : 100=0.02%, 250=27.04%, 500=70.86%, 750=1.48%, 1000=0.59%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.01%
  cpu          : usr=2.05%, sys=4.07%, ctx=6203586, majf=0, minf=156
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,6203520,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=1767MiB/s (1853MB/s), 1767MiB/s-1767MiB/s (1853MB/s-1853MB/s), io=379GiB (407GB), run=219426-219426msec

Disk stats (read/write):
    dm-0: ios=48/6202801, merge=0/0, ticks=0/1847772, in_queue=1847772, util=100.00%, aggrios=11/1240704, aggrmerge=0/0, aggrticks=0/54395, aggrin_queue=54396, aggrutil=100.00%
  nvme0n1: ios=0/930528, merge=0/0, ticks=0/44443, in_queue=44442, util=100.00%
  nvme3n1: ios=0/930528, merge=0/0, ticks=0/43407, in_queue=43407, util=100.00%
  nvme1n2: ios=26/1550880, merge=0/0, ticks=2/66257, in_queue=66259, util=100.00%
  nvme4n2: ios=12/1550880, merge=0/0, ticks=1/62603, in_queue=62604, util=100.00%
  nvme2n1: ios=0/930528, merge=0/0, ticks=0/43607, in_queue=43607, util=100.00%
  nvme0n2: ios=36/1550880, merge=0/0, ticks=2/66292, in_queue=66294, util=100.00%
  nvme3n2: ios=18/1550880, merge=0/0, ticks=2/64633, in_queue=64634, util=100.00%
  nvme1n1: ios=0/930528, merge=0/0, ticks=0/44427, in_queue=44426, util=100.00%
  nvme4n1: ios=0/930528, merge=0/0, ticks=0/43023, in_queue=43023, util=100.00%
  nvme2n2: ios=20/1550880, merge=0/0, ticks=1/65263, in_queue=65265, util=100.00%